; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v6 ?v8)
             (pred_5 ?v12 ?v13)
             (pred_8 ?v6 ?v13)
             (pred_4 ?v11 ?v6 )
	     (pred_7 ?v6)
             (pred_6 ?v2)
             (pred_3 ?v12)
             (pred_10 ?v13)
             (pred_12 ?v6)
             (pred_9 ?v12)
             (pred_2 ?v6)
             (pred_1 ))



(:action op_3
:parameters (?v5 ?v10 ?v4 ?v1)
:precondition (and (pred_6 ?v5) (pred_6 ?v10) (pred_3 ?v4) (pred_10 ?v1)
          (pred_11 ?v5 ?v10) (pred_5 ?v4 ?v1)
                   (pred_8 ?v10 ?v1) (pred_7 ?v5) 
                   (pred_12 ?v10) (pred_9 ?v4))
:effect (and  (pred_2 ?v10) (not (pred_12 ?v10))))


(:action op_2
:parameters (?v5 ?v3)
:precondition (and (pred_6 ?v5) (pred_6 ?v3)
               (pred_7 ?v5) (pred_11 ?v5 ?v3) (pred_2 ?v3))
:effect (and (pred_7 ?v3) (not (pred_7 ?v5))))

(:action op_1
:parameters (?v5 ?v4)
:precondition (and (pred_6 ?v5) (pred_3 ?v4) 
                  (pred_7 ?v5) (pred_4 ?v4 ?v5) (pred_1 ))
:effect (and (pred_9 ?v4)
   (not (pred_4 ?v4 ?v5)) (not (pred_1 ))))


(:action op_5
:parameters (?v5 ?v9 ?v7)
:precondition (and (pred_6 ?v5) (pred_3 ?v9) (pred_3 ?v7)
                  (pred_7 ?v5) (pred_9 ?v7) (pred_4 ?v9 ?v5))
:effect (and (pred_9 ?v9) (pred_4 ?v7 ?v5)
        (not (pred_9 ?v7)) (not (pred_4 ?v9 ?v5))))

(:action op_4
:parameters (?v5 ?v4)
:precondition (and (pred_6 ?v5) (pred_3 ?v4) 
                  (pred_7 ?v5) (pred_9 ?v4))
:effect (and (pred_1 ) (pred_4 ?v4 ?v5) (not (pred_9 ?v4)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_28 obj_24 obj_17 obj_11 obj_14 obj_08 obj_30 obj_29 obj_10 obj_27 obj_22 obj_04 obj_21 obj_03 obj_20 obj_12 obj_16 obj_09 obj_23 obj_19 obj_13 obj_18 obj_05 obj_01 obj_15
    obj_07 obj_25
    obj_02 obj_26 obj_06
    )

    (:init
       (pred_1)

       (pred_6 obj_28)
       (pred_6 obj_24)
       (pred_6 obj_17)
       (pred_6 obj_11)
       (pred_6 obj_14)
       (pred_6 obj_08)
       (pred_6 obj_30)
       (pred_6 obj_29)
       (pred_6 obj_10)
       (pred_6 obj_27)
       (pred_6 obj_22)
       (pred_6 obj_04)
       (pred_6 obj_21)
       (pred_6 obj_03)
       (pred_6 obj_20)
       (pred_6 obj_12)
       (pred_6 obj_16)
       (pred_6 obj_09)
       (pred_6 obj_23)
       (pred_6 obj_19)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_05)
       (pred_6 obj_01)
       (pred_6 obj_15)
       (pred_10 obj_07)
       (pred_10 obj_25)
       (pred_3 obj_02)
       (pred_3 obj_26)
       (pred_3 obj_06)

       (pred_11 obj_28 obj_08)
       (pred_11 obj_28 obj_24)
       (pred_11 obj_24 obj_30)
       (pred_11 obj_24 obj_17)
       (pred_11 obj_24 obj_28)
       (pred_11 obj_17 obj_29)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_24)
       (pred_11 obj_11 obj_10)
       (pred_11 obj_11 obj_14)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_14 obj_27)
       (pred_11 obj_14 obj_11)
       (pred_11 obj_08 obj_22)
       (pred_11 obj_08 obj_30)
       (pred_11 obj_08 obj_28)
       (pred_11 obj_30 obj_04)
       (pred_11 obj_30 obj_29)
       (pred_11 obj_30 obj_24)
       (pred_11 obj_30 obj_08)
       (pred_11 obj_29 obj_21)
       (pred_11 obj_29 obj_10)
       (pred_11 obj_29 obj_17)
       (pred_11 obj_29 obj_30)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_10 obj_27)
       (pred_11 obj_10 obj_11)
       (pred_11 obj_10 obj_29)
       (pred_11 obj_27 obj_20)
       (pred_11 obj_27 obj_14)
       (pred_11 obj_27 obj_10)
       (pred_11 obj_22 obj_12)
       (pred_11 obj_22 obj_04)
       (pred_11 obj_22 obj_08)
       (pred_11 obj_04 obj_16)
       (pred_11 obj_04 obj_21)
       (pred_11 obj_04 obj_30)
       (pred_11 obj_04 obj_22)
       (pred_11 obj_21 obj_09)
       (pred_11 obj_21 obj_03)
       (pred_11 obj_21 obj_29)
       (pred_11 obj_21 obj_04)
       (pred_11 obj_03 obj_23)
       (pred_11 obj_03 obj_20)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_03 obj_21)
       (pred_11 obj_20 obj_19)
       (pred_11 obj_20 obj_27)
       (pred_11 obj_20 obj_03)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_12 obj_16)
       (pred_11 obj_12 obj_22)
       (pred_11 obj_16 obj_18)
       (pred_11 obj_16 obj_09)
       (pred_11 obj_16 obj_04)
       (pred_11 obj_16 obj_12)
       (pred_11 obj_09 obj_05)
       (pred_11 obj_09 obj_23)
       (pred_11 obj_09 obj_21)
       (pred_11 obj_09 obj_16)
       (pred_11 obj_23 obj_01)
       (pred_11 obj_23 obj_19)
       (pred_11 obj_23 obj_03)
       (pred_11 obj_23 obj_09)
       (pred_11 obj_19 obj_15)
       (pred_11 obj_19 obj_20)
       (pred_11 obj_19 obj_23)
       (pred_11 obj_13 obj_18)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_18 obj_05)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_18 obj_13)
       (pred_11 obj_05 obj_01)
       (pred_11 obj_05 obj_09)
       (pred_11 obj_05 obj_18)
       (pred_11 obj_01 obj_15)
       (pred_11 obj_01 obj_23)
       (pred_11 obj_01 obj_05)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_15 obj_01)
       (pred_12 obj_10)
       (pred_12 obj_21)
       (pred_12 obj_20)
       (pred_8  obj_10 obj_07)
       (pred_8  obj_21 obj_25)
       (pred_8  obj_20 obj_07)
       (pred_2 obj_28)
       (pred_2 obj_24)
       (pred_2 obj_17)
       (pred_2 obj_11)
       (pred_2 obj_14)
       (pred_2 obj_08)
       (pred_2 obj_30)
       (pred_2 obj_29)
       (pred_2 obj_27)
       (pred_2 obj_22)
       (pred_2 obj_04)
       (pred_2 obj_03)
       (pred_2 obj_12)
       (pred_2 obj_16)
       (pred_2 obj_09)
       (pred_2 obj_23)
       (pred_2 obj_19)
       (pred_2 obj_13)
       (pred_2 obj_18)
       (pred_2 obj_05)
       (pred_2 obj_01)
       (pred_2 obj_15)

       (pred_5  obj_02 obj_07)
       (pred_5  obj_26 obj_25)
       (pred_5  obj_06 obj_25)
       (pred_4 obj_02 obj_29)
       (pred_4 obj_26 obj_22)
       (pred_4 obj_06 obj_12)
       (pred_7 obj_16)
    )

    (:goal (and
       (pred_4 obj_02 obj_14)
       (pred_4 obj_26 obj_23)
    ))
(:constraints
  (always (not (pred_7 obj_21)))
)
)

; plan
1. (op_2 obj_16 obj_04)
   deleted: (pred_7 obj_16)
   added: (pred_7 obj_04)
   goals met: 0 of 2
2. (op_2 obj_04 obj_22)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_22)
   goals met: 0 of 2
3. (op_1 obj_22 obj_26)
   deleted: (pred_4 obj_26 obj_22) (pred_1)
   added: (pred_9 obj_26)
   goals met: 0 of 2
4. (op_2 obj_22 obj_04)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_04)
   goals met: 0 of 2
5. (op_2 obj_04 obj_30)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_30)
   goals met: 0 of 2
6. (op_2 obj_30 obj_29)
   deleted: (pred_7 obj_30)
   added: (pred_7 obj_29)
   goals met: 0 of 2
7. (op_3 obj_29 obj_21 obj_26 obj_25)
   deleted: (pred_12 obj_21)
   added: (pred_2 obj_21)
   goals met: 0 of 2
8. (op_5 obj_29 obj_02 obj_26)
   deleted: (pred_9 obj_26) (pred_4 obj_02 obj_29)
   added: (pred_9 obj_02) (pred_4 obj_26 obj_29)
   goals met: 0 of 2
9. (op_2 obj_29 obj_17)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_17)
   goals met: 0 of 2
10. (op_2 obj_17 obj_11)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_11)
   goals met: 0 of 2
11. (op_3 obj_11 obj_10 obj_02 obj_07)
   deleted: (pred_12 obj_10)
   added: (pred_2 obj_10)
   goals met: 0 of 2
12. (op_2 obj_11 obj_10)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_10)
   goals met: 0 of 2
13. (op_2 obj_10 obj_03)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_03)
   goals met: 0 of 2
14. (op_4 obj_03 obj_02)
   deleted: (pred_9 obj_02)
   added: (pred_1) (pred_4 obj_02 obj_03)
   goals met: 0 of 2
15. (op_2 obj_03 obj_10)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_10)
   goals met: 0 of 2
16. (op_2 obj_10 obj_29)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_29)
   goals met: 0 of 2
17. (op_1 obj_29 obj_26)
   deleted: (pred_4 obj_26 obj_29) (pred_1)
   added: (pred_9 obj_26)
   goals met: 0 of 2
18. (op_2 obj_29 obj_10)
   deleted: (pred_7 obj_29)
   added: (pred_7 obj_10)
   goals met: 0 of 2
19. (op_2 obj_10 obj_03)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_03)
   goals met: 0 of 2
20. (op_2 obj_03 obj_23)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_23)
   goals met: 0 of 2
21. (op_4 obj_23 obj_26)
   deleted: (pred_9 obj_26)
   added: (pred_1) (pred_4 obj_26 obj_23)
   goals met: 1 of 2
22. (op_2 obj_23 obj_03)
   deleted: (pred_7 obj_23)
   added: (pred_7 obj_03)
   goals met: 1 of 2
23. (op_1 obj_03 obj_02)
   deleted: (pred_4 obj_02 obj_03) (pred_1)
   added: (pred_9 obj_02)
   goals met: 1 of 2
24. (op_2 obj_03 obj_10)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_10)
   goals met: 1 of 2
25. (op_2 obj_10 obj_11)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_11)
   goals met: 1 of 2
26. (op_2 obj_11 obj_14)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_14)
   goals met: 1 of 2
27. (op_4 obj_14 obj_02)
   deleted: (pred_9 obj_02)
   added: (pred_1) (pred_4 obj_02 obj_14)
   goals met: 2 of 2
